# SQL Lite

In [28]:
import pandas as pd
import numpy as np
import sqlite3

In [34]:
ratings_file = '~/Dropbox/data/seinfeld/ratings.csv'
ratings_df = pd.read_csv(ratings_file)
display(ratings_df.head(3))

episodes_file = '~/Dropbox/data/seinfeld/episodes.csv'
episodes_df = pd.read_csv(episodes)
display(episode_df.head(3))

   Season  Episode           Title  Rating  Votes
0       1        2    The Stakeout     7.8    649
1       1        3     The Robbery     7.7    565
2       1        4  Male Unbonding     7.6    561

In [35]:
# create table

sql = ''' create table ratings
(SEASON INTEGER,
 EPISODE INTEGER,
 TITLE TEXT,
 RATING REAL,
 VORES INTEGER);
'''

seindb = 'seinfeld.db'

conn = sqlite3.connect(seindb)
c = conn.cursor()
c.execute("DROP TABLE IF EXISTS ratings")

conn.execute(sql)
conn.commit()
print (f'table ratings in database {seindb} created')

table ratings in database seinfeld.db created

In [31]:
# insert entries
seindata = seindf.values
print (f'adding {len(seindata)} records')
sql = 'INSERT INTO ratings VALUES (?, ?, ?, ?, ?)'
conn.executemany(sql, seindata)
conn.commit()

adding 172 records

In [32]:
# reading from db - limit 10 rows
cursor = conn.execute('select * from ratings limit 10')
for n, row in enumerate(cursor):
        print(n, row)

0 (1, 2, 'The Stakeout', 7.8, 649)
1 (1, 3, 'The Robbery', 7.7, 565)
2 (1, 4, 'Male Unbonding', 7.6, 561)
3 (1, 5, 'The Stock Tip', 7.8, 541)
4 (2, 1, 'The Ex-Girlfriend', 7.7, 529)
5 (2, 1, 'The Statue', 8.1, 509)
6 (2, 11, 'The Heart Attack', 8.0, 512)
7 (2, 12, 'The Revenge', 8.4, 497)
8 (2, 13, 'The Deal', 8.3, 515)
9 (2, 2, 'The Pony Remark', 8.0, 573)

In [33]:
# read into DF - using where 
df = pd.read_sql_query("SELECT * from ratings where rating > 8", conn)
df.head(3)

   SEASON  EPISODE        TITLE  RATING  VORES
0       2        1   The Statue     8.1    509
1       2       12  The Revenge     8.4    497
2       2       13     The Deal     8.3    515